import React from "react";
import Slider from "react-slick";
import {
  mainPic,
  headerPic,
  introPic1,
  introPic2,
  currentPic1,
  currentPic2,
  currentPic3,
  timelinePic1,
  timelinePic2,
  footerPic1,
  footerPic2,
  footerPic3,
  carousel1,
  carousel2,
  carousel3,
  carousel4,
  carouselIntro1,
  carouselIntro2,
  carouselIntro3,
  footerMobile1,
  footerMobile2,
  footerMobile3,
} from "../../../assets";
import "../index.css";

const NoneArrow = () => {
  return <div style={{ display: "none" }}></div>;
};

const AboutUs = () => {
  const settings = {
    infinite: true,
    speed: 500,
    autoplay: true,
    slidesToShow: 1,
    slidesToScroll: 1,
    nextArrow: <NoneArrow />,
    prevArrow: <NoneArrow />,
  };
  const settingsIntro = {
    dots: true,
    infinite: true,
    speed: 500,
    autoplay: true,
    slidesToShow: 1,
    slidesToScroll: 1,
    nextArrow: <NoneArrow />,
    prevArrow: <NoneArrow />,
    // customPaging: (i) => (
    //   <div
    //     style={{
    //       width: "25px",
    //       color: "blue",
    //       border: "1px black solid",
    //       marginRight: "20px",
    //     }}
    //   ></div>
    // ),
  };

  return (
    <div className="about-us">
      <div className="about-us-header">
        <div className="about-us-header-pic">
          <img src={headerPic} alt="chula campus" />
        </div>
        <div className="about-us-header-mobile-hidden-div">
          <img
            className="about-us-header-mobile-hidden-img"
            src={carousel1}
            alt=""
          />
        </div>
        <div className="about-us-header-mobile-carousel">
          <Slider {...settings}>
            <div>
              <img src={carousel1} alt="" />
            </div>
            <div>
              <img src={carousel2} alt="" />
            </div>
            <div>
              <img src={carousel3} alt="" />
            </div>
            <div>
              <img src={carousel4} alt="" />
            </div>
          </Slider>
          <div className="about-us-header-title-mobile">
            <h1> “เกียรติภูมิจุฬาฯ</h1>
            <h2>คือเกียรติแห่งการรับใช้</h2>
            <h2>ประชาชน”</h2>
          </div>
        </div>

        <div className="about-us-header-title">
          <h1> “เกียรติภูมิจุฬาฯ</h1>
          <h2>
            คือเกียรติแห่งการรับใช้ <br />
            ประชาชน”
          </h2>
        </div>
      </div>
      <div className="about-us-header-text">
        <h3>ประวัติการก่อตั้งคณะวิศวกรรมศาตร์ จุฬาลงกรณ์มหาวิทยาลัย</h3>
        <p>
          หากจะกล่าวถึงที่มาที่ไปของคณะวิศวกรรมศาสตร์
          จุฬาลงกรณ์มหาวิทยาลัยของเราแล้ว
          ก็คงจะต้องกล่าวย้อนไปในช่วงรัชกาลพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว
          ซึ่งพระองค์ได้ทรงพระกรุณาโปรดเกล้าฯ
          ให้จัดตั้งโรงเรียนมหาดเล็กขึ้นในพระบรมมหาราชวัง
          โดยมีพระราชประสงค์เพื่อจะให้เป็นที่ฝึกหัดข้าราชการสำหรับทำงานราชการต่างพระเนตรพระกรรณของพระองค์
          ต่อมาในรัชกาลพระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว
          ได้ทรงพระกรุณาโปรดเกล้าฯ
          ให้สถาปนายกระดับโรงเรียนมหาดเล็กขึ้นเป็นสถาบันอุดมศึกษา
          และพระราชทานนามใหม่ว่า
          “โรงเรียนข้าราชการพลเรือนของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว”
        </p>
        <p>
          เพื่อให้เป็นไปตามพระราชประสงค์ของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว
          ที่ต้องการให้มีมหาวิทยาลัยขึ้นสำหรับเป็นสถาบันอุดมศึกษาของชาวสยาม
          เมื่อวันที่ 1 มกราคม พ.ศ. 2453
          จึงถือได้ว่าโรงเรียนข้าราชการพลเรือนนี้เป็นต้นกำเนิดของมหาวิทยาลัยในปัจจุบัน
        </p>
      </div>
      <div className="about-us-intro">
        <div className="about-us-intro-pic">
          <div>
            <img src={introPic1} alt="chula students" />
          </div>
          <div>
            <img src={introPic2} alt="chula buildings" />
          </div>
        </div>
        <div className="about-us-intro-mobile-carousel">
          <Slider {...settingsIntro}>
            <div>
              <img src={carouselIntro1} alt="" />
            </div>
            <div>
              <img src={carouselIntro2} alt="" />
            </div>
            <div>
              <img src={carouselIntro3} alt="" />
            </div>
          </Slider>
        </div>

        <div className="about-us-intro-text">
          <h3>ก้าวแรกสู่วิศวฯ จุฬาฯ</h3>
          <p>
            &emsp; &emsp;คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย
            มีต้นกำเนิดมาจากโรงเรียนเกษตรวิศวกรรมการคลอง
            และโรงเรียนยันตรศึกษาแห่งโรงเรียนข้าราชการพลเรือนโดยใน พ.ศ. 2454
            พระยาศรีวรวงศ์ผู้บัญชาการกระทรวงเกษตราธิการได้โอนโรงเรียนเกษตรวิศวกรรมการคลองซึ่งตั้งอยู่ที่วังใหม่
            ให้มาสังกัดกับโรงเรียนข้าราชการพลเรือน
            ในปีต่อมาเจ้าพระยาธรรมศักดิ์มนตรีได้มาเป็นผู้บัญชาการโรงเรียนข้าราชการพลเรือน
            จึงได้ให้จัดตั้งโรงเรียนช่างกลขึ้น
            วางหลักสูตรหาอาจารย์มาเพิ่มเติมให้มากที่สุดเท่าที่จะมากได้โดยนักเรียนช่างกลชุดแรกก็คือนักเรียนจากโรงเรียนเกษตรวิศวกรรมการคลองที่โรงเรียนข้าราชการพลเรือนได้รับมอบมานั่นเองพร้อมทั้งวังใหม่สถานที่ของโรงเรียนเกษตรก็ได้จัดตั้งเป็นโรงเรียนช่างกลและได้เปิดสอนโดยสมบูรณ์
            โดยมีชื่อว่า
            "โรงเรียนยันตรศึกษาแห่งโรงเรียนข้าราชการพลเรือนของพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว"{" "}
          </p>
          <p>
            &emsp; &emsp;ตั้งแต่วันที่ 1 มิถุนายน พ.ศ. 2456 เป็นต้นมา
            นับเป็นจุดเริ่มต้นของคณะวิศวกรรมศาสตร์อย่างแท้จริง
            ครั้นเมื่อได้รับโอนโรงเรียนฝึกหัดอาจารย์ของกระทรวงธรรมการ มาเป็น
            โรงเรียนนคุรุศึกษาของโรงเรียนข้าราชการพลเรือนแล้ว
            โรงเรียนทั้งหมดในสังกัดโรงเรียนข้าราชพลเรือนก็ได้ย้ายมาตั้งรวมกันที่วังใหม่ปทุมวันและได้วางระเบียบเครื่องแต่งกายและสีแถบคอเสื้อของนักเรียนแผนกต่างๆขึ้น
            คือ ยันตรศึกษา สีเลือดหมู คุรุศาสตร์ สีเหลือง แพทยศาสตร์ สีเขียว
            และรัฐประศาสนศาสตร์ สีดำ และทางราชการได้มอบให้พระยาวิทยาปรีชามาตย์
            (ขณะนั้นเป็นพระอนุภาษศิษยานุสาร) ผู้อำนวยการโรงเรียนคุรุศึกษา
            เข้ามารักษาการตำแหน่งผู้อำนวยการโรงเรียนยันตรศึกษาด้วยอีกตำแหน่งหนึ่งตั้งแต่
            พ.ศ.2457 โดยมีพระอนุยุตยันตรการเป็นหัวหน้า อาจารย์ และต่อมา มิสเตอร์
            วิกโก้ ลุนด์ ได้เป็นหัวหน้าอาจารย์แทน ใน พ.ศ. 2459 ตามลำดับ
          </p>
          <p>
            &emsp; &emsp;
            ครั้นเมื่อได้รับโอนโรงเรียนฝึกหัดอาจารย์ของกระทรวงธรรมการ มาเป็น
            โรงเรียนนคุรุศึกษาของโรงเรียนข้าราชการพลเรือนแล้ว
            โรงเรียนทั้งหมดในสังกัดโรงเรียนข้าราชพลเรือนก็ได้ย้ายมาตั้งรวมกันที่วังใหม่ปทุมวันและได้วางระเบียบเครื่องแต่งกายและสีแถบคอเสื้อของนักเรียนแผนกต่างๆ
            ขึ้น คือ ยันตรศึกษา สีเลือดหมู คุรุศาสตร์ สีเหลือง แพทยศาสตร์
            สีเขียว และรัฐประศาสนศาสตร์ สีดำ
            และทางราชการได้มอบให้พระยาวิทยาปรีชามาตย์
            (ขณะนั้นเป็นพระอนุภาษศิษยานุสาร) ผู้อำนวยการโรงเรียนคุรุศึกษา
            เข้ามารักษาการตำแหน่งผู้อำนวยการโรงเรียนยันตรศึกษาด้วยอีกตำแหน่งหนึ่งตั้งแต่
            พ.ศ. 2457 โดยมีพระอนุยุตยันตรการเป็นหัวหน้า อาจารย์ และต่อมา
            มิสเตอร์ วิกโก้ ลุนด์ ได้เป็นหัวหน้าอาจารย์แทน ใน พ.ศ. 2459 ตามลำดับ
          </p>
        </div>
      </div>
      <div className="about-us-main">
        <img
          className="about-us-main-pic"
          src={mainPic}
          alt="Chula building 2"
        />
        <div className="about-us-main-pic-hidden-div">
          <img
            className="about-us-main-pic-hidden-img"
            src={mainPic}
            alt="Chula building 2"
          />
        </div>
      </div>
      <div className="about-us-main-mobile">
        <img src={introPic2} alt="" />
      </div>
      <div className="about-us-timeline">
        <h3>คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ยุคบุกเบิก</h3>
        <div className="about-us-timeline-container">
          <div className="about-us-timeline-pic">
            <div className="about-us-timeline-div">
              <img src={timelinePic1} alt="chula building" />
            </div>
            <div className="about-us-timeline-div">
              <img src={timelinePic2} alt="chula building" />
            </div>
          </div>
          <div className="about-us-timeline-line"></div>
          <div className="about-us-timeline-text">
            <div>
              <div className="about-us-timeline-text-dot about-us-timeline-text-dot-first"></div>
              <p>พ.ศ. 2459 </p>
            </div>
            <p>
              วันที่ 26 มีนาคม พ.ศ. 2459
              พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัวได้ทรงพระกรุณโปรดเกล้าฯให้สถาปนาประดิษฐานโรงเรียนข้าราชการพลเรือนเป็นจุฬาลงกรณ์มหาวิทยาลัย
              โรงเรียนยันตรศึกษาจึงเปลี่ยนมาเป็นคณะวิศวกรรมศาสตร์แห่งจุฬาลงกรณ์มหาวิทยาลัยตั้งแต่นั้นมา
              โดยมี พระยานิพัทธ์กุลพงศ์
              ดำรงตำแหน่งเป็นคณบดีคนแรกได้จัดหลักสูตรการเรียนให้สูงขึ้นตามกาสสมัย
              รับนักเรียนเฉพาะแต่ที่สำเร็จชั้นมัธยมปีที่ 8 ของกระทรวงธรรมการ
              และขยายเวลาเรียนออกเป็น 4 ปี
              ย้ายสถานที่เล่าเรียนจากวังใหมไปเรียนที่ตึกบัญชาการหรือเทวาลัย
              (ตึกเรียนของคณะอักษรศาสตร์ในปัจจุบัน)
              ก่อนที่จะย้ายมาเรียนที่ตึกวิศวกรรมศาสตร์ 1 (ตึกแดงหรือปราสาทแดง)
              ซึ่งเป็นตึกของคณะวิศวกรรมศาสตร์ในปัจจุบัน เมื่อ พ.ศ. 2475
              ได้จัดหาอุปกรณ์การสอนเพิ่มเติมขึ้นตามความจำเป็นและสร้างโรงงานเครื่องกลึง
              เครื่องหล่อ เครื่องช่างไม้ เครื่องไฟฟ้าหอวิทยาศาสตร์และอื่น ๆ
              อีกเป็นลำดับเรื่อยมาทำให้ไม่จำเป็นต้องส่งนักเรียนออกไปฝึกหัดนอกโรงเรียนเช่นแต่ก่อนอีก
            </p>
            <div>
              <div className="about-us-timeline-text-dot"></div>
              <p>พ.ศ. 2472</p>
            </div>
            <p>
              ต่อมาวันที่ 11 มิถุนายน พ.ศ. 2472
              พระยาวิทยาปชามาตย์ได้ย้ายไปรับหน้าที่ปลัดทูลฉลองกระทรวงธรรมการ
              และรักษาการหน้าที่ผู้บัญชาการจุฬาลงกรณ์มหาวิทยาลัยพระเจริญวิศวกรรมจึงเข้ารับหน้าที่คณบดีคณะวิศวกรรมศาสตร์
              ตั้งแต่นั้นมาการเรียนก็ได้จัดให้เป็นระเบียบยิ่งขึ้น โดยในช่วง พ.ศ.
              2474-2475 ได้มีการแยกการเรียนการสอนออกเป็นแผนก 3 แผนก คือ
              วิศวกรรมโยธา วิศวกรรมไฟฟ้า และวิศวกรรมเครื่องกล
            </p>
            <div>
              <div className="about-us-timeline-text-dot"></div>
              <p>พ.ศ. 2476</p>
            </div>
            <p>
              ในเวลาต่อมาเจ้าพระยาธรรมศักดิ์มนตรีรัฐมนตรีว่าการกระทรวงธรรมการเห็นสมควรว่าถึงเวลาที่จะจัดให้การเรียนวิชาวิศวกรรมศาสตร์สูงขึ้นถึงชั้นปริญญา
              จึงได้เตรียมการลงมือแก้ไขเพิ่มเติมอุปกรณ์การสอน
              โรงงานและอาจารย์ให้เหมาะสมกับวิทยฐานะและในวันที่ 13 กรกฎาคม พ.ศ.
              2478ก็ได้มีนิสิตวิศวกรรมศาสตร์เข้ารับปริญญาวิศวกรรมศาสตรบัณฑิตเป็นชุดแรกพร้อมๆ
              กับเปิดการศึกษาแผนกวิศวกรรมช่างอากาศขึ้น
              ด้วยความร่วมมือจากกองทัพอากาศโดยกระทรวงกลโหมจัดส่งนายทหารฝ่ายเทคนิคช่างอากาศมาช่วยสอนและใช้โรงงานของทหารอากาศบางซื่อและดอนเมืองเป็นที่ฝึกงาน
            </p>
            <p>
              <div className="about-us-timeline-text-dot"></div>
              <div>พ.ศ. 2481</div>
            </p>
            <p>
              ในปีพ.ศ. 2481
              ทางมหาวิทยาลัยได้จัดให้มีโรงเรียนเตรียมอุดมศึกษาแห่งจุฬาลงกรณ์มหาวิทยาลัยขึ้นโดยรับผู้ที่สำเร็จชั้นมัธยมปีที่6ของกระทรวงธรรมการเข้าเรียนวิชาเตรียมวิศวกรรมศาสตร์
              2 ปี กล่าวคือ ตั้งแต่พ.ศ. 2483
              ผู้ที่จะเข้าศึกษาในคณะวิศวกรรมศาสตร์ชั้นปีที่1จะต้องเป็นนักเรียนที่สำเร็จมาจากโรงเรียนเตรียมอุดมศึกษาทั้งสิ้นซึ่งโรงเรียนนี้ได้ผลิตนักเรียนเตรียมวิศวกรรมศาสตร์เป็นรุ่นแรกจำนวน
              99 คน
            </p>
            <p>
              ดังนั้น ตั้งแต่ พ.ศ. 2491เป็นต้นมา
              คณะวิศวกรรมศาสตร์จึงรับสมัครผู้ที่สำเร็จจากโรงเรียนเตรียมอุดมศึกษาของกระทรวงศึกษาธิการหรือเทียบเท่าทุกแห่ง
              โดยผู้ที่จะเข้าเรียนจะต้องผ่านการสอบคัดเลือกของมหาวิทยาลัยเสียก่อนและได้ดำเนินการในระบบดังกล่าวมาจนถึงปัจจุบัน
            </p>
          </div>
        </div>
      </div>

      <div className="about-us-current">
        <div>
          <img className="about-us-current-pic-1" src={currentPic1} alt="" />
          <img
            className="about-us-current-pic-1-mobile"
            src={currentPic2}
            alt=""
          />
        </div>
        <div className="about-us-current-header-text">
          <h3>
            คณะวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย ยุคปัจจุบัน (พ.ศ. 2556
            เป็นต้นมา)
          </h3>
          <p>
            &emsp; &emsp; ตลอดระยะเวลาที่ผ่านมา
            คณะวิศวกรรมศาสตร์ได้มีการขยายและปรับปรุงศักยภาพในด้านต่าง ๆ
            ของคณะให้เจริญก้าวหน้ายิ่งขึ้นมีการจัดสร้าง
            โรงงานและตึกเรียนเพิ่มเติมคือ สร้างตึกเรียนหลังที่ 2 ตึกเรียนหลังที่
            3 และตึกเรียนหลังที่ 4 ใน พ.ศ. 2482, 2506 และ 2537 ตามลำดับ
            ต่อเติมห้องทดลอง ของภาควิชาต่าง ๆ
            สั่งเครื่องมือและอุปกรณ์การทดลองต่างๆมาเพิ่มขึ้นทุกปีเพื่อให้เพียงพอสำหรับใช้ในการเรียนการสอนอีกทั้งทางคณะยังได้ส่งอาจารย์ออกไป
            ศึกษาดูงาน ณ ต่างประเทศ รวมถึงเรื่องการเปลี่ยนแปลงหลักสูตรให้เหมาะสม
            โดยใน พ.ศ. 2513
            คณะวิศวกรรมศาสตร์ได้เริ่มใช้ระบบเรียนแบบหน่วยกิจซึ่งช่วยให้
            นิสิตสามารถเรียนจนสำเร็จการศึกษาภายในเวลา 4 ปี ได้เป็นจำนวนมากขึ้น
          </p>
        </div>
        <div className="about-us-current-pic-middle">
          <div>
            <img src={currentPic2} alt="" />
          </div>
          <div>
            <img src={currentPic3} alt="" />
          </div>
        </div>
        <div className="about-us-current-main-text">
          <p>
            &emsp; &emsp; ต่อมาใน พ.ศ. 2544 คณะวิศวกรรมศาสตร์ได้จัดตั้ง
            International School of Engineering (ISE)
            เพื่อดูแลนิสิตต่างชาติในระดับมหาบัณฑิตและ
            ระดับดุษฎีบัณฑิตในช่วงแรกมีนิสิต 9 ราย จากโครงการ AUN/SEED-Net
            และทุนประเทศเพื่อนบ้านของจุฬาลงกรณ์มหาวิทยาลัยปัจจุบันนิสิตต่างชาติดังกล่าวมี
            ประมาณ 40 คน ทั้งจากแหล่งทุน AUN/SEED-Net ทุนบริษัท
            ปตท.สำรวจและผลิตปิโตรเลียม จำกัด (มหาชน) ทุนรัฐบาลเวียดนาม
            ทุนส่วนตัวรวมถึงนิสิต โครงการแลกเปลี่ยนของมหาวิทยาลัย
          </p>
          <p>
            &emsp; &emsp; จากนั้นในปีการศึกษา 2548
            ได้รับนิสิตระดับปริญญาบัณฑิตในหลักสูตรวิศวกรรมนาโนและหลักสูตร
            วิศวกรรมออกแบบและผลิตยานยนต์ (หลักสูตรนานาชาติ)
            และเปลี่ยนชื่อสำนักงาน ISE เป็นสำนักบริหารหลักสูตรวิศวกรรมนานาชาติ
            ตามมติที่ประชุมคณะกรรมการประจำคณะวิศวกรรมศาสตร์
            เพื่อดูแลการเรียนการสอนและการใช้ชีวิตของนิสิตในหลักสูตรนานาชาติ
            ทั้งนี้เป็นไปตามนโยบายการขยายการศึกษานานาชาติของมหาวิทยาลัยและนโยบายการ
            พัฒนาคณะไปสู่ความเป็นผู้นำด้านการศึกษาวิศวกรรมในเอเชียของคณะฯ
            ในเวลาเดียวกัน และในปีการศึกษา 2549 ได้มีการเปิดหลักสูตรนานาชาติ
            ระดับ ปริญญาบัณฑิต
            สาขาวิศวกรรมอากาศยานและสาขาวิศวกรรมเทคโนโลยีสารสนเทศ
          </p>
          <p>
            &emsp; &emsp; ปี พ.ศ. 2556 คณะวิศวกรรมศาสตร์ เปิดสอนภาควิชาต่าง ๆ
            เพิ่มมากขึ้นตามความต้องการของประเทศ มีภาควิชารวมทั้งหมด 12 ภาควิชา
            กับ 1 สำนัก ได้แก่
          </p>
          <div className="about-us-current-main-major">
            <p>
              {`
            1. ภาควิชาวิศวกรรมโยธา
            2. ภาควิชาวิศวกรรมไฟฟ้า
            3. ภาควิชาวิศวกรรมเครื่องกล
            4. ภาควิชาวิศวกรรมอุตสาหการ
            5. ภาควิชาวิศวกรรมเคมี
            6. ภาควิชาวิศวกรรมเหมืองแร่และปิโตรเลียม
            7. ภาควิชาวิศวกรรมสิ่งแวดล้อม
            8. ภาควิชาวิศวกรรมสำรวจ
            9. ภาควิชาวิศวกรรมโลหการ
              `}
            </p>
            <p className="about-us-current-main-major-p">
              {`
              10. ภาควิชาวิศวกรรมนิวเคลียร์
              11. ภาควิชาวิศวกรรมคอมพิวเตอร์
              12. ภาควิชาวิศวกรรมแหล่งน้ำ
              13. สำนักบริหารหลักสูตรวิศวกรรมนานาชาติ (ISE)
                          13.1. ภาควิชาวิศวกรรมเทคโนโลยีสารสนเทศ (ICE)
                          13.2 ภาควิชาวิศวกรรมออกแบบและผลิตยานยนต์ (ADME)
                          13.3 ภาควิชาวิศวกรรมอากาศยาน (AERO)
                          13.4 ภาควิชาวิศวกรรมนาโน (NANO)
                          13.5 ภาควิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (Robotics AI)
              `}
            </p>
            <p className="about-us-current-main-major-p-mobile">
              {`
10. ภาควิชาวิศวกรรมนิวเคลียร์
11. ภาควิชาวิศวกรรมคอมพิวเตอร์
12. ภาควิชาวิศวกรรมแหล่งน้ำ
13. สำนักบริหารหลักสูตรวิศวกรรมนานาชาติ (ISE)
              13.1. ภาควิชาวิศวกรรมเทคโนโลยีสารสนเทศ (ICE)
              13.2 ภาควิชาวิศวกรรมออกแบบและผลิตยานยนต์ (ADME)
              13.3 ภาควิชาวิศวกรรมอากาศยาน (AERO)
              13.4 ภาควิชาวิศวกรรมนาโน (NANO)
              13.5 ภาควิศวกรรมหุ่นยนต์และปัญญาประดิษฐ์ (Robotics AI)
              `}
            </p>
          </div>
        </div>
      </div>

      <div className="about-us-footer">
        <div>
          <img src={footerPic1} alt="chula students" />
        </div>
        <div>
          <img src={footerPic2} alt="chula building" />
        </div>
        <div>
          <img src={footerPic3} alt="chula building" />
        </div>
      </div>
      <div className="about-us-footer-mobile">
        <div>
          <img src={footerMobile1} alt="chula students" />
        </div>
        <div>
          <img src={footerMobile2} alt="chula building" />
        </div>
        <div>
          <img src={footerMobile3} alt="chula building" />
        </div>
      </div>
    </div>
  );
};

export default AboutUs;
